The product data range of the fabrication part.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public string ProductDataRange { get; }
  Visual Basic
Public ReadOnly Property ProductDataRange As String
	Get
  Visual C++
public:
property String^ ProductDataRange {
	String^ get ();
}
 See Also
  FabricationPart Class
  Autodesk.Revit.DB Namespace